In [1]:
import pandas as pd

In [35]:
import pandas as pd

df1 = pd.DataFrame({'Nome': ['Joao','Pedro'], 'idade': [20, 23]})
df2 = pd.DataFrame({'Nome': ['Julia','Alessandro'], 'idade': [21, 30]})

df_resultante = pd.concat([df1, df2], axis=0, ignore_index=True)
df_resultante

#AXIS --> 0 ou 1 para concatenar linhas ou colunas respectivamente
#IGNORE_INDEX --> PARA REORGANIZAR OS INDICES

         Nome  idade
0        Joao     20
1       Pedro     23
2       Julia     21
3  Alessandro     30

In [37]:
df_1 = pd.DataFrame({'Nome': ['Joao','Pedro'], 'idade': [20, 23]})
df_2 = pd.DataFrame({'Nome': ['Julia','Alessandro'], 'idade': [21, 30]})

df_resultante2 = pd.concat([df1, df2], axis=1, keys = ('df_1','df_2'))
df_resultante2

#KEYS --> mostra qual Ã© o dataframe respectivo das colunas

    df_1              df_2
    Nome idade        Nome idade
0   Joao    20       Julia    21
1  Pedro    23  Alessandro    30

In [49]:
df_x = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df_y = pd.DataFrame({'B': [7, 8], 'C': [9, 10]})

resultado = pd.concat([df_x, df_y], axis=0, ignore_index=True, join = 'inner')
resultado

#JOIN --> INNER / OUTER , APENAS COLUNAS EM COMUNS E TODAS AS COLUNAS RESPECTIVAMENTE

   B
0  3
1  4
2  7
3  8